gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_RECORD.c


#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_GET.h"
#include "../DL698/DL698_GET_RECORD.h"
#include "../DL698/RM_TASK.h"

#include "../DL698/DL698_TESAM.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"

#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/DL698_GET_iMeter.h"
#include "../DL698/DL698_GET_6000.h"
#include "../DL698/DL698_GET_F000.h"
#include "../DL698/DL698_GET_EVENT.h"
#include "../MS/MS.h"
#include "../DL698/RM_Record.h"
#include "../DL698/CONGEAL_Record.h"
#include "../DL698/EVENT_Record.h"

#include "../Calculate/Calculate.h"
#include "../Terminal698/Terminal_Init.h"
#include "../DL698/DL698_REPORT.h"


#include "../DL698/DL698_JSON.h"




u32 GET_RecordOAD(u32 PORTn,u8 *p8rx)//读一个记录型对象属性;返回:b31-b16接收ROAD长度,b15-b0发送ROAD及数据字节数,数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 n;
	u32 LEN_RSD;
	u32 LEN_MS;
	u32 LEN_RxOAD;
	UARTCtrl_TypeDef *UARTCtrl;
	u8* p8SOUR;
	u8* pDATA;
	u8 *p8tx;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;
	u32 M_Offset;
	u32 LEN_TxData;
	u32 LEN_ReadData;
	ms_Type* ms;
	u16 *p16;
	u16* p16s;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//客户机连接信息
	u32 OAD;
	DL698_SETLIB_TypeDef *pLib;
	u32 NUMmax;
	u32 MeterCount;
	u32 NUMmax_LIST;
	u64 d64;
	u32 FileID;
	u32 NUM_TIDOT;
	
#if(USER/100)==17//江苏系
	u32 filename;
	msFILE_TypeDef *file;
	u8 *p8d;
	RecordFileHead_TypeDef* RecordFileHead;
#endif
	
	p16=(u16*)(ADDR_1kDATABUFF);
	p16[0]=0;//清0，RCSD为全选时和设置事件时的OAD列表，数
	
	ms=Get_ms();
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;
	p16=(u16 *)Get_ADDR_UARTnTimer_S(PORTn);//秒定时器
	p16[0]=TimerS_UARTRAMFREE;
	OAD=(p8rx[0]<<24)+(p8rx[1]<<16)+(p8rx[2]<<8)+p8rx[3];
//GetRequestRecord∷=SEQUENCE
//{
//  服务序号-优先级         PIID，
//  读取一个记录型对象属性  GetRecord
//}
//GetRecord∷=SEQUENCE
//{
//  对象属性描述符     OAD，
//  记录选择描述符     RSD，
//  记录列选择描述符   RCSD
//}
	LEN_RxOAD=0;
	LEN_TxAPDU=0;
	UARTCtrl->LEN_TxData=0;//需发送数据总长度(包括每段前的2字节段长度)
	UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
	switch(OAD)//对象属性描述符     OAD
	{
//---60xx配置 START----
		case 0x60000200://采集档案配置表
		case 0x60120200://任务配置表
		case 0x60140200://普通采集方案集
		case 0x60160200://事件采集方案集
		case 0x60180200://透明方案集
		case 0x601E0200://采集规则库
			FLASHtoSDRAM();//参数FLASHtoSDRAM
			switch(p8rx[4])//记录选择描述符RSD
			{
				case 0:
		//不选择       [0]  NULL
					LEN_RxOAD+=4+1;
				
					pLib=Get_DL698_SET_pLib(OAD);//得到SET_pLib指针;入口:OI=对象标识,Attribute=属性号;返回:Lib指针(=0表示无相应的OI)
					if(pLib==0)
					{
						UARTCtrl->DAR=6;//对象不存在           （6）
						break;
					}
					NUMmax=pLib->LENmax/pLib->LENper;
					LENmax_TxSPACE=ms->ms_malloc_sizemax();
					pDATA=(u8*)ms->ms_malloc(LENmax_TxSPACE);
					if(pDATA==0)
					{
							UARTCtrl->DAR=255;
							break;
					}
					LEN_TxAPDU=0;
					switch(OAD)//对象属性描述符     OAD
					{
						case 0x60000200://采集档案配置表
							p8SOUR=(u8*)ADDR_6000_SDRAM;
							OAD=0x60010200;//标准单元
							break;
						case 0x60120200://任务配置表
							p8SOUR=(u8*)ADDR_6012_2_SDRAM;
							OAD=0x60130200;//标准单元
							break;
						case 0x60140200://普通采集方案集
							p8SOUR=(u8*)ADDR_6014_SDRAM;
							OAD=0x60150200;//标准单元
							break;
						case 0x60160200://事件采集方案集
							p8SOUR=(u8*)ADDR_6016_SDRAM;
							OAD=0x60170200;//标准单元
							break;
						case 0x60180200://透明方案集
							p8SOUR=(u8*)pLib->Addr;
							OAD=0x60190200;//标准单元
							break;
						case 0x601E0200://采集规则库
							p8SOUR=(u8*)pLib->Addr;
							OAD=0x601F0200;//标准单元
							break;
					}
					//修改列选择
					MR(ADDR_DATABUFF,(u32)p8rx,LEN_RxOAD);
					p8rx=(u8*)ADDR_DATABUFF;
					p8rx[LEN_RxOAD+0]=1;
					p8rx[LEN_RxOAD+1]=0;
					p8rx[LEN_RxOAD+2]=OAD>>24;
					p8rx[LEN_RxOAD+3]=(OAD>>16)&0xff;
					p8rx[LEN_RxOAD+4]=(OAD>>8)&0xff;
					p8rx[LEN_RxOAD+5]=(OAD>>0)&0xff;
					for(n=0;n<NUMmax;n++)
					{
						if(LENmax_TxSPACE<2)
						{
							break;
						}
						x=Get_DL698DataLen_S((u8*)p8SOUR,pLib->LENper);//得到DL698数据类型长度(包括:类型字节和数据);
						if(x>2)
						{
							x+=2;//数据块长度(包括本身2字节)
							if(x>LENmax_TxSPACE)
							{
								UARTCtrl->DAR=255;//错误代码
								break;
							}
							pDATA[LEN_TxAPDU+0]=x;
							pDATA[LEN_TxAPDU+1]=x>>8;
							MR((u32)pDATA+LEN_TxAPDU+2,(u32)p8SOUR,x-2);
							LEN_TxAPDU+=x;
							LENmax_TxSPACE-=x;
						}
						p8SOUR+=pLib->LENper;
					}
					pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
					UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
					UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
					UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
					break;
				case 1:
		//Selector1∷=SEQUENCE
		//{
		//  对象属性描述符  OAD，
		//  数值            Data
		//}
//05 03 08 
//60 00 02 00 对象属性描述符     OAD
				
//01 60 01 02 01 12 00 01 记录选择描述符RSD
//01 00 60 01 02 00 //记录列选择描述符RCSD
//00 无时间标签
					LEN_RxOAD+=4;
					pLib=Get_DL698_SET_pLib(OAD);//得到SET_pLib指针;入口:OI=对象标识,Attribute=属性号;返回:Lib指针(=0表示无相应的OI)
					if(pLib==0)
					{
						UARTCtrl->DAR=6;//对象不存在           （6）
						break;
					}
					switch(p8rx[8])//用于行选择的元素号
					{
						case 1://选择第一个元素(配置序号等)
							switch(p8rx[9])
							{
								case DataType_unsigned:
									n=p8rx[10];
									LEN_RSD=7;
									break;
								case DataType_long_unsigned:
								default:
									n=(p8rx[10]<<8)+p8rx[11];
									LEN_RSD=8;
									break;
							}
							LEN_RxOAD+=LEN_RSD;
							if(n>=(pLib->LENmax/pLib->LENper))
							{
								UARTCtrl->DAR=255;
								break;
							}
							n*=pLib->LENper;
							n+=pLib->Addr;
//							LEN_TxAPDU=Get_DL698DataLen((u8*)n,(Attribute_TypeDef *)pLib->pDataType,0,pLib->LENmax);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128K_DATABUFF用,返回:b31-b8长度,b7-b0元素计数
							LEN_TxAPDU=Get_DL698DataLen((u8*)n,(Attribute_TypeDef *)0,0,pLib->LENmax);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128K_DATABUFF用,返回:b31-b8长度,b7-b0元素计数
							if(pLib->pDataType)
							{
								if((LEN_TxAPDU&0xff)==0)
								{
									UARTCtrl->DAR=7;//类型不匹配           （7）
									break;
								}
							}
							LEN_TxAPDU>>=8;
							LEN_TxAPDU+=2;//数据块长度(包括本身2字节)
							pDATA=(u8*)ms->ms_malloc(LEN_TxAPDU);
							if(pDATA==0)
							{
								UARTCtrl->DAR=255;//其它                 （255）
								break;
							}
							pDATA[0]=LEN_TxAPDU;
							pDATA[1]=LEN_TxAPDU>>8;
							MR((u32)pDATA+2,n,LEN_TxAPDU-2);
							pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
							UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
							UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
							UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
							break;
						default:
							UARTCtrl->DAR=255;//其它                 （255）
							break;
					}
					break;
				case 2:
		//Selector2∷=SEQUENCE
		//{
		//  对象属性描述符  OAD，
		//  起始值          Data，
		//  结束值          Data，
		//  数据间隔        Data
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 3:
		//Selector3∷=SEQUENCE OF Selector2
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 4:
		//Selector4∷=SEQUENCE
		//{
		//  采集启动时间  date_time_s，
		//  电能表集合    MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 5:
		//Selector5∷=SEQUENCE
		//{
		//  采集存储时间  date_time_s，
		//  电能表集合    MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 6:
		//Selector6∷=SEQUENCE
		//{
		//  采集启动时间起始值  date_time_s，
		//  采集启动时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 7:
		//Selector7∷=SEQUENCE
		//{
		//  采集存储时间起始值  date_time_s，
		//  采集存储时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 8:
		//Selector8∷=SEQUENCE
		//{
		//  采集成功时间起始值  date_time_s，
		//  采集成功时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 9:
		//Selector9∷=SEQUENCE
		//{
		//  上第n次记录  unsigned
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 10:
		//Selector10∷=SEQUENCE
		//{
		//上n条记录  unsigned，
		//电能表集合  MS
		//}
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				default:
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
			}
			break;
			
