gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_RECORD.c
//---60配置 END----
			
//---6034采集任务监控 START----
		case 0x60340200://采集任务监控数据
			switch(p8rx[4])//记录选择描述符RSD
			{
				default:
					UARTCtrl->DAR=6;//对象不存在           （6）
					break;
				case 1:
		//Selector1∷=SEQUENCE
		//{
		//  对象属性描述符  OAD，
		//  数值            Data
		//}
//05 03 08 
//60 00 02 00 对象属性描述符     OAD
//01 60 01 02 01 12 00 01 记录选择描述符RSD
//01 00 60 01 02 00 //记录列选择描述符RCSD
//00 无时间标签

//05 03 0e 
//60 34 02 00 对象属性描述符     OAD
//01 60 35 02 01 11 01 记录选择描述符RSD,用第一个元素任务ID unsigned进行记录行选择
//00 记录列选择描述符RCSD
//00 无时间标签
					LEN_RxOAD+=4;
					//LEN_RSD=8;
					//LEN_RxOAD+=LEN_RSD;
					
					switch(p8rx[8])//用于行选择的元素号
					{
						case 1://任务ID unsigned进行记录行选择
							p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
							LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
							LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
						#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
							ClientConnectInfo=ClientConnectInfo;
						#else
							//客户机接收缓冲长度
							ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
							i=ClientConnectInfo->LEN_Rx;
							i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							if(i<2048)
							{
								i=2048;
							}
							if(i>(TxAPDUOffset+1))
							{//不为0
								i-=(TxAPDUOffset+1);
								if(LENmax_TxSPACE>i)
								{
									LENmax_TxSPACE=i;
								}
							}
						#endif
//68 42 00 C3 05 01 00 00 00 00 00 10 75 85 85 03 0C 
//60 34 02 00 01 
//00 60 35 02 00 01 01 02 08 11 01 16 02 1C 07 E0 0B 0B 00 02 00 1C 07 E0 0B 0B 00 02 02 12 00 02 12 00 02 12 00 02 12 00 02 00 00 3D 50 16 
							p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
							p8tx[0]=133;//读取响应         	[133]	GET-Response
							p8tx[1]=3;//[3] GeResponseRecord
							p8tx[2]=UARTCtrl->PIID;//PIID-ACD
							p8tx[3]=p8rx[0];//OAD
							p8tx[4]=p8rx[1];
							p8tx[5]=p8rx[2];
							p8tx[6]=p8rx[3];
							p8tx[7]=1;//有数据
							p8tx[8]=0;//OAD类型
							p8tx[9]=0x60;
							p8tx[10]=0x35;
							p8tx[11]=0x02;
							p8tx[12]=0x00;
							p8tx[13]=1;//记录数据
							p8tx[14]=1;//M条
							
							n=p8rx[10];//任务ID
							if(n>=RMTASKmax)
							{
								UARTCtrl->DAR=255;
								break;
							}
							RM_Monitor(n,0,0);//采集任务监控;入口:ID=任务号,NUM_Tx=发送条数,NUM_Rx=接收条数
							n=ADDR_6034+(n*LENper_6034);
							LEN_TxAPDU=Get_DL698DataLen((u8*)n,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128K_DATABUFF用,返回:b31-b8长度,b7-b0元素计数
							LEN_TxAPDU>>=8;
							if((15+LEN_TxAPDU)>LENmax_TxSPACE)
							{
								UARTCtrl->DAR=255;
								break;
							}
							MR((u32)p8tx+15,n,LEN_TxAPDU);
							LEN_TxAPDU+=15;
							return LEN_TxAPDU;
						default:
							UARTCtrl->DAR=255;
							break;
					}
					break;
				}
			break;
//---6034采集任务监控 END----
				
		case 0x60020200://所有搜表结果
			UARTCtrl->DAR=255;//错误代码
			return 0;
		case 0x60020500://跨台区搜表结果
			UARTCtrl->DAR=255;//错误代码
			return 0;
			
		case 0x601A0200://透明方案结果集
		case 0x601C0200://上报方案集
			UARTCtrl->DAR=255;//错误代码
			return 0;
		
//---60120300任务配置表 START----
		case 0x60120300://任务配置表属性3抄表记录
			//计算RSD长度
			LEN_RSD=DataLen_RSD_NoMS(p8rx+4,0,0);//内联的MS长度不计
			LEN_RSD>>=8;
			if(LEN_RSD)
			{
				LEN_RSD--;//无数据类型
			}
			//计算MS长度
			if((p8rx[4]==0)||(p8rx[4]==9))//0=不选择无MS,9=上第n次记录无MS
			{
				LEN_MS=0;
			}
			else
			{
				LEN_MS=DataLen_MS(p8rx+4+LEN_RSD,0,0);
				LEN_MS>>=8;
				if(LEN_MS)
				{
					LEN_MS--;//无数据类型
				}
			}
			LEN_RxOAD+=4;
			LEN_RxOAD+=LEN_RSD;
			LEN_RxOAD+=LEN_MS;
			LENmax_TxSPACE=ms->ms_malloc_sizemax();
			pDATA=(u8*)ms->ms_malloc(LENmax_TxSPACE);
			if(pDATA==0)
			{
				UARTCtrl->DAR=255;
				break;
			}
			if(p8rx[4]==0)
			{//不选择无MS
				NUMmax_LIST=0;
				p16=(u16*)(ADDR_AddrList+2);
				p8SOUR=(u8*)ADDR_6000_SDRAM;
				for(i=0;i<NUMmax_6000;i++)
				{
					if(p8SOUR[0]==DataType_structure)
					{
						p16s=(u16*)(p8SOUR+10);//取采集档案配置序号的通信地址
						p16[0]=p16s[0];
						p16[1]=p16s[1];
						p16[2]=p16s[2];
						p16+=3;
						NUMmax_LIST+=1;
					}
					p8SOUR+=LENper_6000;
				}
				p16=(u16*)(ADDR_AddrList);
				p16[0]=NUMmax_LIST;
			}
			else
			{
				if(p8rx[4]==9)//9=上第n次记录无MS
				{
					p16=(u16*)(ADDR_AddrList);
					p16[0]=1;//无MS,为了下程序for()能进入计算用值=1
				}
				else
				{
					MStoAddrList(p8rx+4+LEN_RSD);//电能表集合到地址列表;入口:pMS(无数据类型);出口:地址列表在ADDR_AddrList
				}
			}
			p16=(u16*)(ADDR_AddrList);
			NUMmax_LIST=p16[0];
			LEN_TxAPDU=0;
			//注:RCSD前没数据类型，RCSDtoFileID()或RCSDtoID()是有数据类型
			FileID=RCSDtoFileID(p8rx+LEN_RxOAD-1);//记录列选择RCSD相对应的FileID,入口:pRCSD指向类型字节;返回:0表示没找到无效FileID,当有2个上相同方案时TaskNO=0xff
			if(FileID==0)
			{//0表示没找到无效FileID
				pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
				UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
				UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
				UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
				break;
			}
			for(MeterCount=0;MeterCount<NUMmax_LIST;MeterCount++)
			{
				if(LENmax_TxSPACE>2)
				{
					switch(p8rx[4])
					{
						case 0:
				//不选择       [0]  NULL
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;//错误代码
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							break;
						case 1:
				//Selector1∷=SEQUENCE
				//{
				//  对象属性描述符  OAD，
				//  数值            Data
				//}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							break;
						case 2:
				//Selector2∷=SEQUENCE
				//{
				//  对象属性描述符  OAD，
				//  起始值          Data，
				//  结束值          Data，
				//  数据间隔        Data
				//}
							n=(p8rx[5]<<24)|(p8rx[6]<<16)|(p8rx[7]<<8)|p8rx[8];
							switch(n)
							{
								case 0x20210200://数据冻结时间
									if((p8rx[4+5]==DataType_date_time_s)&&(p8rx[4+5+8]==DataType_date_time_s))
									{
										if((p8rx[4+5+8+8]==DataType_TI)||(p8rx[4+5+8+8]==0))
										{
											x=Compare_DL698DataString(p8rx+4+5+1,p8rx+4+5+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
											NUM_TIDOT=0;//数据招读时最大按TI间隔的数据点数
											while((x!=1)&&(NUM_TIDOT<NUMmax_TIDOT))
											{
												NUM_TIDOT++;
												if(LENmax_TxSPACE<2)
												{
													break;
												}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
												x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
												if(x)
												{
													x+=2;//数据块长度(包括本身2字节)
													if(x>LENmax_TxSPACE)
													{
														UARTCtrl->DAR=255;//错误代码
														break;
													}
													pDATA[LEN_TxAPDU+0]=x;
													pDATA[LEN_TxAPDU+1]=x>>8;
													LEN_TxAPDU+=x;
													LENmax_TxSPACE-=x;
												}
												//数据间隔
												if(p8rx[4+5+8+8]==0)
												{//TI=空
													break;
												}
												else
												{
													x=pTItoSECOND(p8rx+4+5+8+8+1);//TI转为秒值,入口:pTI无数据类型,出口:hex秒
													if(x==0)
													{//无间隔
														break;
													}
												}
												pYYMDHMS_AddTI_hex(p8rx+4+5+1,p8rx+4+5+8+8+1);//年年月日时分秒加时间间隔TI,入口:pYYMDHMS,pTI无数据类型,返回加间隔TI后的年年月日时分秒
												//pYYMDHMS_AddS_hex(p8rx+4+5+1,x);//年年月日时分秒加S秒,返回加S秒后的年年月日时分秒
												x=Compare_DL698DataString(p8rx+4+5+1,p8rx+4+5+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
											}
										}
									}
									break;
								default:
									break;
							}
							break;
						case 3:
				//Selector3∷=SEQUENCE OF Selector2
							n=(p8rx[6]<<24)|(p8rx[7]<<16)|(p8rx[8]<<8)|p8rx[9];
							switch(n)
							{
								case 0x20210200://数据冻结时间
									NUMmax=p8rx[5];
									if(NUMmax>=2)
									{
										n=Compare_DL698DataString(p8rx+4+2,p8rx+4+6+8+8+4,4+8+8+4);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
										if(n==0)
										{
											if(NUMmax)
											{
												NUMmax--;//2个时间相同
											}
										}
									}
									for(n=0;n<NUMmax;n++)
									{
										if((p8rx[4+6]==DataType_date_time_s)&&(p8rx[4+6+8]==DataType_date_time_s))
										{
											if((p8rx[4+6+8+8]==DataType_TI)||(p8rx[4+6+8+8]==0))
											{
												x=Compare_DL698DataString(p8rx+4+6+1,p8rx+4+6+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
												NUM_TIDOT=0;//数据招读时最大按TI间隔的数据点数
												while((x!=1)&&(NUM_TIDOT<NUMmax_TIDOT))
												{
													NUM_TIDOT++;
													if(LENmax_TxSPACE<2)
													{
														break;
													}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
													x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
													if(x)
													{
														x+=2;//数据块长度(包括本身2字节)
														if(x>LENmax_TxSPACE)
														{
															UARTCtrl->DAR=255;//错误代码
															break;
														}
														pDATA[LEN_TxAPDU+0]=x;
														pDATA[LEN_TxAPDU+1]=x>>8;
														LEN_TxAPDU+=x;
														LENmax_TxSPACE-=x;
													}
													//数据间隔
													if(p8rx[4+6+8+8]==0)
													{//无间隔
														break;
													}
													else
													{
														x=pTItoSECOND(p8rx+4+6+8+8+1);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
														if(x==0)
														{//无间隔
															break;
														}
													}
													pYYMDHMS_AddTI_hex(p8rx+4+6+1,p8rx+4+6+8+8+1);//年年月日时分秒加时间间隔TI,入口:pYYMDHMS,pTI无数据类型,返回加间隔TI后的年年月日时分秒
													//pYYMDHMS_AddS_hex(p8rx+4+6+1,x);//年年月日时分秒加S秒,返回加S秒后的年年月日时分秒
													x=Compare_DL698DataString(p8rx+4+6+1,p8rx+4+6+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
												}
											}
										}
										if(n)
										{
											MW((u32)p8rx,(u32)p8rx+(4+6+8+8+4)-6,6);
										}
										p8rx+=4+8+8+4;
										if(LEN_RSD>=(4+8+8+4))
										{
											LEN_RSD-=(4+8+8+4);
										}
									}
									p8rx-=NUMmax*(4+8+8+4);
									LEN_RSD+=NUMmax*(4+8+8+4);
									break;
								default:
									break;
							}
							break;
						case 4:
				//Selector4∷=SEQUENCE
				//{
				//  采集启动时间  date_time_s，
				//  电能表集合    MS
				//}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;//错误代码
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							break;
						case 5:
				//Selector5∷=SEQUENCE
				//{
				//  采集存储时间  date_time_s，
				//  电能表集合    MS
				//}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;//错误代码
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							break;
						case 6:
				//Selector6∷=SEQUENCE
				//{
				//  采集启动时间起始值  date_time_s，
				//  采集启动时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
						case 7:
				//Selector7∷=SEQUENCE
				//{
				//  采集存储时间起始值  date_time_s，
				//  采集存储时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
						case 8:
				//Selector8∷=SEQUENCE
				//{
				//  采集成功时间起始值  date_time_s，
				//  采集成功时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
//05 03 0D 
//60 12 03 00 
//07  Selector7
//07 E0 0B 0B 00 00 00  采集存储时间起始值  date_time_s
//07 E0 0B 0B 17 3B 3B  采集存储时间结束值  date_time_s
//00 FF FF  时间间隔  TI
//01 04 00 20 2A 02 00 00 00 10 02 00 00 20 00 02 00 00 20 01 02 00 
//00 
							d64=MRR((u32)p8rx+4+1,7);
							x=Compare_DL698DataString(p8rx+4+1,p8rx+4+1+7,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
							NUM_TIDOT=0;//数据招读时最大按TI间隔的数据点数
							while((x!=1)&&(NUM_TIDOT<NUMmax_TIDOT))
							{
								NUM_TIDOT++;
								if(LENmax_TxSPACE<2)
								{
									break;
								}
//u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
								x=GET_RecordFileData(FileID,0xffffffff,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
								if(x)
								{
									x+=2;//数据块长度(包括本身2字节)
									if(x>LENmax_TxSPACE)
									{
										UARTCtrl->DAR=255;//错误代码
										break;
									}
									pDATA[LEN_TxAPDU+0]=x;
									pDATA[LEN_TxAPDU+1]=x>>8;
									LEN_TxAPDU+=x;
									LENmax_TxSPACE-=x;
								}
//								if(p8rx[4]==8)
//								{//采集成功时间
//									break;
//								}
								x=pTItoSECOND(p8rx+4+1+7+7);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
								if(x==0)
								{//无间隔
									break;
								}
								pYYMDHMS_AddTI_hex(p8rx+4+1,p8rx+4+1+7+7);//年年月日时分秒加时间间隔TI,入口:pYYMDHMS,pTI无数据类型,返回加间隔TI后的年年月日时分秒
								//pYYMDHMS_AddS_hex(p8rx+4+1,x);//年年月日时分秒加S秒,返回加S秒后的年年月日时分秒
								x=Compare_DL698DataString(p8rx+4+1,p8rx+4+1+7,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
							}
							MWR(d64,(u32)p8rx+4+1,7);
							break;
						case 9:
				//Selector9∷=SEQUENCE
				//{
				//  上第n次记录  unsigned
				//}
							UARTCtrl->DAR=255;//错误代码
							break;
						case 10:
				//Selector10∷=SEQUENCE
				//{
				//上n条记录  unsigned，
				//电能表集合  MS
				//}
							NUMmax=p8rx[4+1];//上n条记录
							i=0;//开始文件计数号
							while(1)
							{
								if((NUMmax==0)||(i>=127))
								{
									break;
								}
//u32 Get_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							#if(USER/100)==17//江苏系
								
								
