gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_RECORD.c
								if(FileID==MeterAutoReportFileID_3011)
								{
										Comm_Ram->msFILESearchCount=0;
										filename=Get_RecordFileName(FileID,0xffffffff,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
										if(filename!=0xffffffff)
										{//找到
											if(filename<FILENAMEmax_FLASH)
											{
												file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
											}
											else
											{
												file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
											}
											i=file->LEN_DATA;
											if(i>(NUM_RMmax*sizeof(RecordFileHead_TypeDef)))
											{
												i-=(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
											}
											//ms=Get_ms();
											//p8d=(u8*)ms->ms_realloc(p8d,i);
											//p8d=(u8*)ms->ms_malloc(i);//动态分配我的内存堆
											p8d=(u8*)ADDR_DATABUFF;
											if(p8d)
											{
												//ms->ms_free(p8d);//释放我的内存堆分配
												ms->msfile_read(filename,NUM_RMmax*sizeof(RecordFileHead_TypeDef),p8d,i);
												n=file->NUM_DATA;
												if((n*sizeof(RecordFileHead_TypeDef))>LEN_128KDATABUFF)
												{
													n=0;
												}
												ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,n*sizeof(RecordFileHead_TypeDef));
												RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF);
												for(i=0;i<n;i++)
												{
													x=Get_RecordFileData_RCSD(p8rx+4+LEN_RSD+LEN_MS,(u8*)&RecordFileHead->Addr0,p8d,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2,0);//记录表的列选择;入口:pRCSD指向行选择的RCSD(无数据类型),pTSA,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
													if(x)
													{
														//f=1;//有找到数据标志
														NUMmax--;//上n条-1
														x+=2;//数据块长度(包括本身2字节)
														if(x>LENmax_TxSPACE)
														{
															UARTCtrl->DAR=255;//错误代码
															break;
														}
														pDATA[LEN_TxAPDU+0]=x;
														pDATA[LEN_TxAPDU+1]=x>>8;
														LEN_TxAPDU+=x;
														LENmax_TxSPACE-=x;
													}
													p8d+=RecordFileHead->LEN_DATA;
													RecordFileHead++;
												}
												MeterCount=NUMmax_LIST+1;
												break;
//												
												}
											}
										
								}
								else
								x=GET_RecordFileData(FileID,i,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							#else	
								x=GET_RecordFileData(FileID,i,(u16*)((ADDR_AddrList+2)+(6*MeterCount)),p8rx+4,p8rx+4+LEN_RSD+LEN_MS,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
							#endif	
								if(x)
								{
									//f=1;//有找到数据标志
									NUMmax--;//上n条-1
									x+=2;//数据块长度(包括本身2字节)
									if(x>LENmax_TxSPACE)
									{
										UARTCtrl->DAR=255;//错误代码
										break;
									}
									pDATA[LEN_TxAPDU+0]=x;
									pDATA[LEN_TxAPDU+1]=x>>8;
									LEN_TxAPDU+=x;
									LENmax_TxSPACE-=x;
								}
								i++;//文件计数号
							}
							break;
						default:
							UARTCtrl->DAR=255;//错误代码
							break;
					}
				}
			}
			pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
			UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
			UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
			UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
			break;
//---60120300任务配置表 END----
			
//---50终端冻结 START---
		case 0x50000200://瞬时冻结
		case 0x50010200://秒冻结
		case 0x50020200://分钟冻结
		case 0x50030200://小时冻结
		case 0x50040200://日冻结
		case 0x50050200://结算日冻结
		case 0x50060200://月冻结
		case 0x50070200://年冻结
		case 0x50080200://时区表切换冻结
		case 0x50090200://日时段表切换冻结
		case 0x500A0200://费率电价切换冻结
		case 0x500B0200://阶梯切换冻结
		case 0x50110200://阶梯结算冻结
//05 03 03 
//50 04 02 00 01 20 21 02 00 1c 07 E0 01 14 00 00 00 02 00 20 21 02 00 00 00 10 02 00 00
			//计算RSD长度
			LEN_RSD=DataLen_RSD_NoMS(p8rx+4,0,0);//内联的MS长度不计
			LEN_RSD>>=8;
			if(LEN_RSD)
			{
				LEN_RSD--;//无数据类型
			}
			LEN_RxOAD+=4;
			LEN_RxOAD+=LEN_RSD;
			LENmax_TxSPACE=ms->ms_malloc_sizemax();
			if(LENmax_TxSPACE<2)
			{
					UARTCtrl->DAR=255;
					break;
			}
			pDATA=(u8*)ms->ms_malloc(LENmax_TxSPACE);
			if(pDATA==0)
			{
					UARTCtrl->DAR=255;
					break;
			}
			LEN_TxAPDU=0;
			switch(p8rx[4])
			{
				case 0:
		//不选择       [0]  NULL
					UARTCtrl->DAR=255;//错误代码
					break;
				case 1:
		//Selector1∷=SEQUENCE
		//{
		//  对象属性描述符  OAD，
		//  数值            Data
		//}
					x=Get_CongealFileData(OAD>>16,0xffffffff,p8rx+4,p8rx+4+LEN_RSD,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到冻结文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
					if(x)
					{
						x+=2;//数据块长度(包括本身2字节)
						if(x>LENmax_TxSPACE)
						{
							UARTCtrl->DAR=255;
							break;
						}
						pDATA[LEN_TxAPDU+0]=x;
						pDATA[LEN_TxAPDU+1]=x>>8;
						LEN_TxAPDU+=x;
						LENmax_TxSPACE-=x;
					}
					break;
				case 2:
		//Selector2∷=SEQUENCE
		//{
		//  对象属性描述符  OAD，
		//  起始值          Data，
		//  结束值          Data，
		//  数据间隔        Data
		//}
					n=(p8rx[5]<<24)|(p8rx[6]<<16)|(p8rx[7]<<8)|p8rx[8];
					switch(n)
					{
						case 0x20210200://数据冻结时间
							if((p8rx[4+5]==DataType_date_time_s)&&(p8rx[4+5+8]==DataType_date_time_s))
							{
								if((p8rx[4+5+8+8]==DataType_TI)||(p8rx[4+5+8+8]==0))
								{
									x=Compare_DL698DataString(p8rx+4+5+1,p8rx+4+5+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
									while(x!=1)
									{
										if(LENmax_TxSPACE<2)
										{
											break;
										}
										x=Get_CongealFileData(OAD>>16,0xffffffff,p8rx+4,p8rx+4+LEN_RSD,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到冻结文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
										if(x)
										{
											x+=2;//数据块长度(包括本身2字节)
											if(x>LENmax_TxSPACE)
											{
												UARTCtrl->DAR=255;//错误代码
												break;
											}
											pDATA[LEN_TxAPDU+0]=x;
											pDATA[LEN_TxAPDU+1]=x>>8;
											LEN_TxAPDU+=x;
											LENmax_TxSPACE-=x;
										}
										//数据间隔
										if(p8rx[4+5+8+8]==0)
										{
											break;;//x=15*60;//15分
										}
										else
										{
											x=pTItoSECOND(p8rx+4+5+8+8+1);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
											if(x==0)
											{
												break;//x=24*60*60;
											}
										}
										pYYMDHMS_AddTI_hex(p8rx+4+5+1,p8rx+4+5+8+8+1);//年年月日时分秒加时间间隔TI,入口:pYYMDHMS,pTI无数据类型,返回加间隔TI后的年年月日时分秒
										//pYYMDHMS_AddS_hex(p8rx+4+5+1,x);//年年月日时分秒加S秒,返回加S秒后的年年月日时分秒
										x=Compare_DL698DataString(p8rx+4+5+1,p8rx+4+5+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
									}
								}
							}
							break;
						default:
							break;
					}
					break;
				case 3:
		//Selector3∷=SEQUENCE OF Selector2
					n=(p8rx[6]<<24)|(p8rx[7]<<16)|(p8rx[8]<<8)|p8rx[9];
					switch(n)
					{
						case 0x20210200://数据冻结时间
							NUMmax=p8rx[5];
							if(NUMmax>=2)
							{
								n=Compare_DL698DataString(p8rx+4+2,p8rx+4+6+8+8+4,4+8+8+4);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
								if(n==0)
								{
									if(NUMmax)
									{
										NUMmax--;//2个时间相同
									}
								}
							}
							for(n=0;n<NUMmax;n++)
							{
								if((p8rx[4+6]==DataType_date_time_s)&&(p8rx[4+6+8]==DataType_date_time_s))
								{
									if((p8rx[4+6+8+8]==DataType_TI)||(p8rx[4+6+8+8]==0))
									{
										x=Compare_DL698DataString(p8rx+4+6+1,p8rx+4+6+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
										while(x!=1)
										{
											if(LENmax_TxSPACE<2)
											{
												break;
											}
											x=Get_CongealFileData(OAD>>16,0xffffffff,p8rx+4,p8rx+4+LEN_RSD,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到冻结文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
											if(x)
											{
												x+=2;//数据块长度(包括本身2字节)
												if(x>LENmax_TxSPACE)
												{
													UARTCtrl->DAR=255;//错误代码
													break;
												}
												pDATA[LEN_TxAPDU+0]=x;
												pDATA[LEN_TxAPDU+1]=x>>8;
												LEN_TxAPDU+=x;
												LENmax_TxSPACE-=x;
											}
											//数据间隔
											if(p8rx[4+6+8+8]==0)
											{
												break;//x=15*60;//15分
											}
											else
											{
												x=pTItoSECOND(p8rx+4+6+8+8+1);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
												if(x==0)
												{
													break;//x=24*60*60;
												}
											}
											pYYMDHMS_AddTI_hex(p8rx+4+6+1,p8rx+4+6+8+8+1);//年年月日时分秒加时间间隔TI,入口:pYYMDHMS,pTI无数据类型,返回加间隔TI后的年年月日时分秒
											//pYYMDHMS_AddS_hex(p8rx+4+6+1,x);//年年月日时分秒加S秒,返回加S秒后的年年月日时分秒
											x=Compare_DL698DataString(p8rx+4+6+1,p8rx+4+6+8+1,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
										}
									}
								}
								if(n)
								{
									MW((u32)p8rx,(u32)p8rx+(4+6+8+8+4)-6,6);
								}
								p8rx+=4+8+8+4;
								if(LEN_RSD>=(4+8+8+4))
								{
									LEN_RSD-=(4+8+8+4);
								}
							}
							p8rx-=NUMmax*(4+8+8+4);
							LEN_RSD+=NUMmax*(4+8+8+4);
							break;
						default:
							break;
					}
					break;
				case 4:
		//Selector4∷=SEQUENCE
		//{
		//  采集启动时间  date_time_s，
		//  电能表集合    MS
		//}
				case 5:
		//Selector5∷=SEQUENCE
		//{
		//  采集存储时间  date_time_s，
		//  电能表集合    MS
		//}
				case 6:
		//Selector6∷=SEQUENCE
		//{
		//  采集启动时间起始值  date_time_s，
		//  采集启动时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
				case 7:
		//Selector7∷=SEQUENCE
		//{
		//  采集存储时间起始值  date_time_s，
		//  采集存储时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
				case 8:
		//Selector8∷=SEQUENCE
		//{
		//  采集成功时间起始值  date_time_s，
		//  采集成功时间结束值  date_time_s，
		//  时间间隔            TI，
		//  电能表集合          MS
		//}
					break;
				case 9:
		//Selector9∷=SEQUENCE
		//{
		//  上第n次记录  unsigned
		//}
					NUMmax=p8rx[4+1];//上第n次
					if(NUMmax)
					{
						NUMmax--;
					}
					if(p8rx[4+2]==0)
					{//当无一个OAD时，RCSD=0，即SEQUENCE OF的数据项个数为0，表示“不选择（即全选）”
						//增加列选择OAD
						if(LEN_RxOAD<1024)
						{//保证缓冲长度
							MR(ADDR_DATABUFF,(u32)p8rx,LEN_RxOAD);
							p8rx=(u8*)ADDR_DATABUFF;
							n=MRR(ADDR_5004+1,1);//日冻结关联对象属性表
							p8rx[LEN_RxOAD]=n;//个数
							for(x=0;x<n;x++)
							{
								p8rx[LEN_RxOAD+1+(5*x)]=0;//OAD
								MR((u32)p8rx+LEN_RxOAD+1+(5*x)+1,ADDR_5004+2+(x*13)+6,4);
							}
						}
					}
					x=Get_CongealFileData(OAD>>16,NUMmax,p8rx+4,p8rx+4+LEN_RSD,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2);//得到冻结文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
					if(x)
					{
						x+=2;//数据块长度(包括本身2字节)
						if(x>LENmax_TxSPACE)
						{
							UARTCtrl->DAR=255;
							break;
						}
						pDATA[LEN_TxAPDU+0]=x;
						pDATA[LEN_TxAPDU+1]=x>>8;
						LEN_TxAPDU+=x;
						LENmax_TxSPACE-=x;
					}
			#if (USER/100)==0//电科院测试
					else
					{
						//01 00 90 01 09 00
						i=p8rx[4+LEN_RSD]<<8;
						i|=p8rx[4+LEN_RSD+1];
						if(i==0x0100)
						{
							i=p8rx[4+LEN_RSD+2]<<24;
							i|=p8rx[4+LEN_RSD+3]<<16;
							i|=p8rx[4+LEN_RSD+4]<<8;
							i|=p8rx[4+LEN_RSD+5];
							if(i==0x90010900)
							{
								x=1+2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								pDATA[LEN_TxAPDU+2]=0;//数据空
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
						}
					}
			#endif
					break;
				case 10:
		//Selector10∷=SEQUENCE
		//{
		//上n条记录  unsigned，
		//电能表集合  MS
		//}
				default:
					break;
			}
			pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
			UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
			UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
			UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
			break;
//---50终端冻结 END---
			
		default:
			switch(OAD>>28)
			{
//---事件记录 START---
				case 3://事件记录
					switch(p8rx[4])//记录选择描述符RSD
					{
						case 0:
				//不选择       [0]  NULL
							
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 1:
				//Selector1∷=SEQUENCE
				//{
				//  对象属性描述符  OAD，
				//  数值            Data
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 2:
				//Selector2∷=SEQUENCE
				//{
				//  对象属性描述符  OAD，
				//  起始值          Data，
				//  结束值          Data，
				//  数据间隔        Data
				//}
//05 03 0d 
//30 0f 02 00 
//02
//20 1e 02 00 
//1c 07 e1 05 1f 0d 2f 1c 
//1c 07 e1 05 1f 0d 30 3b 
//54 00 00 00 
//00
//00
//电科院电压相序测试时用到，暂与读最近一次相同，实际没用
//返回
//85 03 0D 
//30 0F 02 00 
//04 
//00 20 22 02 00 
//00 20 1E 02 00 
//00 20 20 02 00 
//00 20 24 02 00 
//01 00 
//00 00 
							LEN_RSD=25;
							LEN_RxOAD+=4+LEN_RSD;
							OAD&=0xffffff00;
							OAD|=1;//上第n次
							GET_EventRecord(PORTn,OAD,(u8*)ADDR_128KDATABUFF,LEN_128KDATABUFF,1);//得到事件记录;入口:ALL=0只事件无OAD列表,ALL=1有OAD列表;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
							if(UARTCtrl->DAR)
							{
								//无事件，电科院测试时需返回有数据
								UARTCtrl->DAR=0;
								p8tx=(u8*)ADDR_1kDATABUFF;
								p8tx[0]=4;
								MWR(0x0002222000,ADDR_1kDATABUFF+1,5);
								MWR(0x00021e2000,ADDR_1kDATABUFF+1+5,5);
								MWR(0x0002202000,ADDR_1kDATABUFF+1+5+5,5);
								MWR(0x0002242000,ADDR_1kDATABUFF+1+5+5+5,5);
								pDATA=(u8*)ms->ms_malloc(1);//仅使指针不为空，其他无用
								if(pDATA==0)
								{
									UARTCtrl->DAR=255;
									break;
								}
								UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
								UARTCtrl->LEN_TxData=0;//需发送数据总长度(包括每段前的2字节段长度)
								UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
								break;
							}
							LENmax_TxSPACE=ms->ms_malloc_sizemax();
							if(LENmax_TxSPACE<2)
							{
								UARTCtrl->DAR=255;
								break;
							}
							pDATA=(u8*)ms->ms_malloc(LENmax_TxSPACE);
							if(pDATA==0)
							{
								UARTCtrl->DAR=255;
								break;
							}
							LEN_TxAPDU=0;
							x=GET_EventRecord_RCSD(OAD,p8rx+4+LEN_RSD,(u8*)ADDR_128KDATABUFF,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向接收的RCSD(无数据类型),pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
							UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
							UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
							UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
							break;
						case 3:
				//Selector3∷=SEQUENCE OF Selector2
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 4:
				//Selector4∷=SEQUENCE
				//{
				//  采集启动时间  date_time_s，
				//  电能表集合    MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 5:
				//Selector5∷=SEQUENCE
				//{
				//  采集存储时间  date_time_s，
				//  电能表集合    MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 6:
				//Selector6∷=SEQUENCE
				//{
				//  采集启动时间起始值  date_time_s，
				//  采集启动时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 7:
				//Selector7∷=SEQUENCE
				//{
				//  采集存储时间起始值  date_time_s，
				//  采集存储时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 8:
				//Selector8∷=SEQUENCE
				//{
				//  采集成功时间起始值  date_time_s，
				//  采集成功时间结束值  date_time_s，
				//  时间间隔            TI，
				//  电能表集合          MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						case 9:
				//Selector9∷=SEQUENCE
				//{
				//  上第n次记录  unsigned
				//}
							LEN_RSD=2;
							LEN_RxOAD+=4+LEN_RSD;
							n=p8rx[5];//上第n次
							OAD&=0xffffff00;
							OAD|=n;
							GET_EventRecord(PORTn,OAD,(u8*)ADDR_128KDATABUFF,LEN_128KDATABUFF,1);//得到事件记录;入口:ALL=0只事件无OAD列表,ALL=1有OAD列表;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
							if(UARTCtrl->DAR)
							{
								break;
							}
							LENmax_TxSPACE=ms->ms_malloc_sizemax();
							if(LENmax_TxSPACE<2)
							{
								UARTCtrl->DAR=255;
								break;
							}
							pDATA=(u8*)ms->ms_malloc(LENmax_TxSPACE);
							if(pDATA==0)
							{
								UARTCtrl->DAR=255;
								break;
							}
							LEN_TxAPDU=0;
							x=GET_EventRecord_RCSD(OAD,p8rx+4+LEN_RSD,(u8*)ADDR_128KDATABUFF,pDATA+LEN_TxAPDU+2,LENmax_TxSPACE-2,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向接收的RCSD(无数据类型),pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
							if(x)
							{
								x+=2;//数据块长度(包括本身2字节)
								if(x>LENmax_TxSPACE)
								{
									UARTCtrl->DAR=255;
									break;
								}
								pDATA[LEN_TxAPDU+0]=x;
								pDATA[LEN_TxAPDU+1]=x>>8;
								LEN_TxAPDU+=x;
								LENmax_TxSPACE-=x;
							}
							pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU);
							UARTCtrl->pTxData=pDATA;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
							UARTCtrl->LEN_TxData=LEN_TxAPDU;//需发送数据总长度(包括每段前的2字节段长度)
							UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
							break;
						case 10:
				//Selector10∷=SEQUENCE
				//{
				//上n条记录  unsigned，
				//电能表集合  MS
				//}
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
						default:
							UARTCtrl->DAR=6;//对象不存在           （6）
							break;
					}
					break;
//---事件记录 END---
					
//---未知  START---
				default:
//RET_ErrDAR:
					if(UARTCtrl->pTxData)//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
					{
						ms->ms_free(UARTCtrl->pTxData);
						UARTCtrl->pTxData=0;
					}
					//计算RSD长度
					LEN_RSD=DataLen_RSD_NoMS(p8rx+4,0,0);//内联的MS长度不计
					LEN_RSD>>=8;
					if(LEN_RSD)
					{
						LEN_RSD--;//无数据类型
					}
					LEN_RxOAD=4+LEN_RSD;
					LEN_TxAPDU=0;
					//break;

					p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
					LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
					LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
					p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
					p8tx[0]=133;//读取响应         	[133]	GET-Response
					p8tx[1]=3;//[3] GeResponseRecord
					p8tx[2]=UARTCtrl->PIID;//PIID-ACD
					p8tx[3]=p8rx[0];//OAD
					p8tx[4]=p8rx[1];
					p8tx[5]=p8rx[2];
					p8tx[6]=p8rx[3];
					LEN_TxAPDU=7;
					LENmax_TxSPACE-=LEN_TxAPDU;
					x=LEN_RxOAD;
					n=p8rx[LEN_RxOAD];//SEQUENCE OF CSD个数
					if(n==0)
					{
						//当无一个OAD时，RCSD=0，即SEQUENCE OF的数据项个数为0，表示“不选择（即全选）”。
						p8rx=(u8*)ADDR_1kDATABUFF;
						n=p8rx[0];
						p8rx-=x;
					}
					LEN_RxOAD++;
					while(n--)
					{
						if(p8rx[LEN_RxOAD]==0)
						{
							LEN_RxOAD+=5;
						}
						else
						{
							i=p8rx[LEN_RxOAD+5];
							i*=4;
							i+=6;
							LEN_RxOAD+=i;
						}
					}
					n=LEN_RxOAD-x;//CSD长度
					LEN_RxOAD<<=16;
					if((n+2)>LENmax_TxSPACE)
					{
						UARTCtrl->DAR=8;//越界（8）
						return LEN_RxOAD;
					}
					MR((u32)p8tx+LEN_TxAPDU,(u32)p8rx+x,n);//copy CSD
					LEN_TxAPDU+=n;
					LENmax_TxSPACE-=n;
					p8tx[LEN_TxAPDU]=0;//0=错误
					p8tx[LEN_TxAPDU+1]=4;//对象未定义           （4）
					LEN_TxAPDU+=2;
					return LEN_RxOAD|LEN_TxAPDU;
//---未知  END---
			}
			break;
	}
	
