gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_RECORD.c
//GetResponseRecord∷=SEQUENCE
//{
//  服务序号-优先级-ACD         PIID-ACD，
//  一个记录型对象属性及其结果  A-ResultRecord
//}
//A-ResultRecord∷=CHOICE
//{
//  错误信息       [0] DAR，
//  记录数据       [1] A-RecordData
//}
//A-RecordData∷=SEQUENCE
//{
//  记录型对象属性描述符    	OAD，
//  一行记录N列属性描述符 	RCSD，
//  M条记录                	SEQUENCE OF A-RecordRow
//}
//A-RecordRow∷=SEQUENCE
//{
//  第1列数据   Data，
//  第2列数据   Data，
//  …
//  第N列数据   Data
//}
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
	p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
	p8tx[0]=133;//读取响应         	[133]	GET-Response
	p8tx[1]=3;//[3] GeResponseRecord
	p8tx[2]=UARTCtrl->PIID;//PIID-ACD
	p8tx[3]=p8rx[0];//OAD
	p8tx[4]=p8rx[1];
	p8tx[5]=p8rx[2];
	p8tx[6]=p8rx[3];
	LEN_TxAPDU=7;
	LENmax_TxSPACE-=LEN_TxAPDU;
	
	x=LEN_RxOAD;
	n=p8rx[LEN_RxOAD];//SEQUENCE OF CSD个数
	if(n==0)
	{
		//当无一个OAD时，RCSD=0，即SEQUENCE OF的数据项个数为0，表示“不选择（即全选）”。
		p8rx=(u8*)ADDR_1kDATABUFF;
		n=p8rx[0];
		p8rx-=x;
	}
	LEN_RxOAD++;
	while(n--)
	{
		if(p8rx[LEN_RxOAD]==0)
		{
			LEN_RxOAD+=5;
		}
		else
		{
			i=p8rx[LEN_RxOAD+5];
			i*=4;
			i+=6;
			LEN_RxOAD+=i;
		}
	}
	n=LEN_RxOAD-x;//CSD长度
	LEN_RxOAD<<=16;
	if((n+2)>LENmax_TxSPACE)
	{
		if(UARTCtrl->pTxData)//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
		{
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
		}
		UARTCtrl->DAR=8;//越界（8）
		return LEN_RxOAD;
	}
	MR((u32)p8tx+LEN_TxAPDU,(u32)p8rx+x,n);//copy CSD
	LEN_TxAPDU+=n;
	LENmax_TxSPACE-=n;
	if(UARTCtrl->pTxData==0)//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
	{
		//UARTCtrl->DAR=6;//对象不存在           （6）
		//return LEN_RxOAD|LEN_TxAPDU;
		UARTCtrl->LEN_TxData=0;//需发送数据总长度(包括每段前的2字节段长度)
	}
	if(UARTCtrl->DAR)
	{//错误
		ms->ms_free(UARTCtrl->pTxData);
		UARTCtrl->pTxData=0;
		//return LEN_RxOAD|LEN_TxAPDU;
		UARTCtrl->DAR=0;
		UARTCtrl->LEN_TxData=0;//需发送数据总长度(包括每段前的2字节段长度)
	}
	
	p8tx[LEN_TxAPDU]=1;//01 —— 记录数据
	M_Offset=LEN_TxAPDU+1;//M条记录偏移
	LEN_TxAPDU+=2;
	LENmax_TxSPACE-=2;
	LEN_TxData=UARTCtrl->LEN_TxData;//需发送数据总长度(包括每段前的2字节段长度)
	LEN_ReadData=UARTCtrl->LEN_ReadData;
	pDATA=UARTCtrl->pTxData;
	n=0;
	while(1)
	{
		if(LEN_ReadData>=LEN_TxData)
		{
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
			break;
		}
		if(n>=127)
		{
			break;
		}
		x=pDATA[LEN_ReadData]+(pDATA[LEN_ReadData+1]<<8);
		if(x<2)
		{
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
			break;
		}
		x-=2;
		if(x>LENmax_TxSPACE)
		{
			break;
		}
		MR((u32)p8tx+LEN_TxAPDU,(u32)pDATA+LEN_ReadData+2,x);
		LEN_TxAPDU+=x;
		LENmax_TxSPACE-=x;
		LEN_ReadData+=x+2;
		n++;//M条记录
	}
	UARTCtrl->LEN_ReadData=LEN_ReadData;
	p8tx[M_Offset]=n;//M条记录
	if(UARTCtrl->pTxData==0)
	{//无下帧
		UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
	else
	{//有下帧
		UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
		UARTCtrl->NEXTBlock=1;
	}
	return LEN_RxOAD|LEN_TxAPDU;
}


u32 GET_RecordOAD_Next(u32 PORTn)//读一个记录型对象属性分帧响应的下一帧;返回：LEN_TxAPDU
{
	u32 i;
	u32 x;
	u32 n;
	UARTCtrl_TypeDef *UARTCtrl;
	u8* p8;
	u8* p8rx;
	u8 *p8tx;
//	u16* p16;
	u32 LEN_SA;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;
	u32 M_Offset;
	u32 LEN_TxData;
	u32 LEN_ReadData;
	ms_Type *ms;
	ClientConnectInfo_TypeDef* ClientConnectInfo;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->pTxData==0)
	{
		return 0;
	}
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	//上帧TX:68 D4 07 C3 05 01 00 00 00 00 00 10 A9 57 85 05 0D  00 00 01  02 01  60 12 03 00  03 00 60 42 02 00 00 20 2A 02 00 01 50 02 02 00 03 20 21 02 00 00 10 02 00 00 20 02 00 01 18 1C 07 E0 0B 0B 00 00 00 55 07 05 00 00 00 00 00 01 01 03 1C 07 E0 0B 0B 00 00 00 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 1C 07 E0 0B 0B 00 0F 00 55 07 05 00 00 00 00 00 01 01 03 1C 07 E0 0B 0B 00 0F 00 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 1C 07 E0 0B 0B 00 1E 00 55 07 05 00 00 00 00 00 01 01 03 1C 07 E0 0B 0B 00 1E 00 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 1C 07 E0 0B 0B 00 2D 00 55 07 05 00 00 00 00 00 01 01 03 1C 07 E0 0B 0B 00 2D 00 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 ...
	//copy Tx到Rx
	LEN_SA=p8tx[4];//取地址字节数
	LEN_SA&=0x0f;
	LEN_SA++;
	x=5+LEN_SA+3+8+4;
	n=p8tx[x];//SEQUENCE OF CSD个数
	x++;
	while(n--)
	{
		if(p8tx[x]==0)
		{//OAD
			x+=5;
		}
		else
		{//ROAD
			i=p8tx[x+5];
			i*=4;
			i+=6;
			x+=i;
		}
	}
	i=Get_LEN_UARTnRx(PORTn);
	if(x>i)
	{
		UARTCtrl->pTxData=0;
		return 0;
	}
	MR((u32)p8rx,(u32)p8tx,x);
	//copy OAD和CSD
	LEN_TxAPDU=x-(5+LEN_SA+3+8);
	MR((u32)p8tx+TxAPDUOffset+3,(u32)p8rx+5+LEN_SA+3+8,LEN_TxAPDU);
	
	p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
	p8tx[0]=133;//读取响应         	[133]	GET-Response
	p8tx[1]=5;//[3] GeResponseRecord,,[5]  GetResponseNext
	p8tx[2]=UARTCtrl->PIID;//PIID-ACD
	//p8tx[3]=p8rx[0];//OAD
	//p8tx[4]=p8rx[1];
	//p8tx[5]=p8rx[2];
	//p8tx[6]=p8rx[3];
	LEN_TxAPDU+=3;
	LENmax_TxSPACE-=LEN_TxAPDU;
	
	p8tx[LEN_TxAPDU]=1;//01 —— 记录数据
	M_Offset=LEN_TxAPDU+1;//M条记录偏移
	LEN_TxAPDU+=2;
	LENmax_TxSPACE-=2;
	LEN_TxData=UARTCtrl->LEN_TxData;
	LEN_ReadData=UARTCtrl->LEN_ReadData;
	p8=UARTCtrl->pTxData;
	n=0;
	while(1)
	{
		if(LEN_ReadData>=LEN_TxData)
		{
			ms=Get_ms();
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
			break;
		}
		if(n>=127)
		{
			break;
		}
		x=p8[LEN_ReadData]+(p8[LEN_ReadData+1]<<8);
		if(x<2)
		{
			ms=Get_ms();
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
			break;
		}
		x-=2;
		if(x>LENmax_TxSPACE)
		{
			break;
		}
		MR((u32)p8tx+LEN_TxAPDU,(u32)p8+LEN_ReadData+2,x);
		LEN_TxAPDU+=x;
		LENmax_TxSPACE-=x;
		LEN_ReadData+=x+2;
		n++;//M条记录
	}
	UARTCtrl->LEN_ReadData=LEN_ReadData;
	p8tx[M_Offset]=n;//M条记录
	if(UARTCtrl->pTxData==0)
	{//无下帧
		UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
	else
	{//有下帧
		UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
//	//copy rx到rx+Rxoffset
//	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
//	i=Get_LEN_UARTnRx(PORTn);
//	x=p8rx[1]+(p8rx[2]<<8);
//	x+=3;//整半字
//	x>>=1;
//	x<<=1;
//	if((x+Rxoffset)>i)
//	{
//		x=i-Rxoffset;
//	}
//	x/=2;
//	p16=(u16*)p8rx;
//	while(x)
//	{
//		x--;
//		p16[(Rxoffset/2)+x]=p16[x];
//	}
	return LEN_TxAPDU;
}























